app/controllers/movies_controller.rb

  def same_director
    @movie = Movie.find(params[:id])
    if @movie.director.to_s.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Superman'